<?php

namespace Web\Model;

use Web\Model\Settings\BasicModel AS Model;

class OrderSettings extends Model
{
    public static function statuses($type)
    {
        $arr = [];
        switch ($type) {
            case 'sending':

                // Відправки
                $arr = [
                    '0' => get_object([
                        'text' => 'На доставку',
                        'color' => '#0fa80f',
                    ]),
                    '1' => get_object([
                        'text' => 'Доставляється',
                        'color' => '#0c0cf5',
                    ]),
                    '2' => get_object([
                        'text' => 'Виконано',
                        'color' => '#c2062c',
                    ])
                ];


                break;
            case 'shop':

                // МАГАЗИН
                $arr = [
                    '0' => get_object([
                        'text' => 'Нове замовлення',
                        'color' => '#0fa80f',
                    ]),
                    '1' => get_object([
                        'text' => 'Виконано',
                        'color' => '#c2062c',
                    ]),

                ];


                break;
            case 'self':

                // Самовивіз
                $arr = [
                    '0' => get_object([
                        'text' => 'На доставку', // нове замовлення, що потрібно доставити
                        'color' => '#0fa80f',
                    ]),
                    '1' => get_object([
                        'text' => 'Доставляється', // видали курьєру, поїхав доставляти
                        'color' => '#0c0cf5',
                    ]),
                    '2' => get_object([
                        'text' => 'Відмінено', // відмінили з якихось причин. Товари відповідно повертаються по БД
                        'color' => '#ff0',
                    ]),
                    '3' => get_object([
                        'text' => 'Повернення', // Товари відповідно повертаються по БД
                        'color' => '#0f0',
                    ]),
                    '4' => get_object([
                        'text' => 'Виконано',   // товар доставлено, гроші отримано, гроші зарахувалися у звіт менеджера,
                        // що поставив статус - Виконано
                        'color' => '#c2062c',
                    ])
                ];
                break;
            case 'delivery':

                // Доставки
                $arr = [
                    '0' => get_object([
                        'text' => 'На доставку', // нове замовлення, що потрібно доставити
                        'color' => '#0fa80f',
                    ]),
                    '1' => get_object([
                        'text' => 'Доставляється', // видали курьєру, поїхав доставляти
                        'color' => '#0c0cf5',
                    ]),
                    '2' => get_object([
                        'text' => 'Відмінено', // відмінили з якихось причин. Товари відповідно повертаються по БД
                        'color' => '#ff0',
                    ]),
                    '3' => get_object([
                        'text' => 'Повернення', // Товари відповідно повертаються по БД
                        'color' => '#0f0',
                    ]),
                    '4' => get_object([
                        'text' => 'Виконано',   // товар доставлено, гроші отримано, гроші зарахувалися у звіт менеджера,
                        // що поставив статус - Виконано
                        'color' => '#c2062c',
                    ])
                ];
                break;
        }
        return $arr;
    }

    public static function regions()
    {
        return [
            'Голосіївський',
            'Оболонський',
            'Печерський',
            'Подільський',
            'Святошинський',
            'Солом\'янський',
            'Шевченківський',
            'Дарницький',
            'Деснянський',
            'Дніпровський'
        ];
    }
}
